git@github.com:kamikaze823/hw2_rottenpotatoes/app/controllers/movies_controller.rb

  def index
    @title = false
    @date = false
    @all_ratings = Movie.allRatings
    @current_checked = []
    current = params["ratings"]
    if current == nil
	@movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (rating = 'G')

  def titlesort
    @titlesortmovies = Movie.order(:title).all
---
SELECT "movies".* FROM "movies" ORDER BY title

  def datesort
    @datesortmovies = Movie.order(:release_date).all
---
SELECT "movies".* FROM "movies" ORDER BY release_date